#Да се напише shell скрипт, който валидира дали дадено цяло число попада в целочислен интервал.
#Скриптът приема 3 аргумента: числото, което трябва да се провери; лява граница на интервала; 
#дясна граница на интервала.
#Скриптът да връща exit status:
#- 3, когато поне един от трите аргумента не е цяло число
#- 2, когато границите на интервала са обърнати
#- 1, когато числото не попада в интервала
#- 0, когато числото попада в интервала

#!/bin/bash    
if [[ ("$1" =~ ^[[0-9]|-]+$ || "$2" =~ ^[[0-9]|-]+$) && ("$1" =~ ^[[0-9]|-]+$ || "$3" =~ ^[[0-9]|-]+$) ]]; then
	if [[ "$2" -gt "$3" ]]; then
		exit 2;
	elif [[ "$1" -lt "$2" || "$1" -gt "$3" ]]; then
		exit 1;
	elif [[ "$1" -ge "$2" && "$1" -le "$3" ]]; then
		exit 0;
	fi
else
	exit 3;
fi 
